#Область ПрограммныйИнтерфейс

//Форма - ФормаДокумента
//@skip-check doc-comment-parameter-section
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма, Форма.Элементы.ГруппаШапкаПраво);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицо(Форма, Форма.Элементы.СуммаДокумента);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
	    ВставитьПолеКонтактноеЛицо(Форма, Форма.Элементы.СуммаДокумента);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма, Форма.Элементы.ГруппаШапкаПраво);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма, Форма.Элементы.ГруппаШапкаПраво);
	КонецЕсли;
		
КонецПроцедуры

//Указываем группу которую необходимо создать и куда вставить
//@skip-check doc-comment-parameter-section
Процедура СоздатьГруппуСкидка(ГруппаКудаВставить, Элементы) Экспорт
		
	Группа = Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"),ГруппаКудаВставить);
	Группа.Вид =ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Группа скидки: ";
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицо(Форма, ГруппаКудаВставить) Экспорт
	
	//На выбранной форме выбераем группу куда неодходимо Добавить Объект.ДЗ_КонтактноеЛицо 
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), ГруппаКудаВставить);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицо(Форма, ВставитьПередЭлементом) Экспорт

	//На выбранной форме выбераем Перед каким элементом неодходимо вставить Объект.ДЗ_КонтактноеЛицо
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, ВставитьПередЭлементом);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";

КонецПроцедуры

#КонецОбласти

